---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
EnergyAnalysisDetailModelOptions Properties
EnergyAnalysisDetailModelOptions Class See Also Send Feedback
---

The EnergyAnalysisDetailModelOptions type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | EnergyModelType | It indicates whether the energy model is based on rooms/spaces or building elements. |
|  | ExportMullions | Indicates if to specify the setting for exporting mullions. |
|  | IncludeShadingSurfaces | Indicates if to set and get the setting for if shading surfaces should be included. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SimplifyCurtainSystems | Indicates if to specify the setting for simplified curtain systems. |
|  | Tier | Level of computation for energy analysis model. |

# See Also

EnergyAnalysisDetailModelOptions Class

Autodesk.Revit.DB.Analysis Namespace